app/views/maint_records/show.html.erb

SELECT "cars"."name" FROM "cars" INNER JOIN "maint_records" ON "maint_records"."car_id" = "cars"."id" WHERE "cars"."1" = ? LIMIT ?  [["1", "1"], ["LIMIT", 1]]
---
<div align="center">
<h1><%= Car.select('name').joins(:maint_records).find_by(@maint_record.car_id => params[:id]) %>'s Maintenance Records</h1>