app/views/users/show.html.erb


<% @user.cars.each do |car|%>

  <%car.photos.each do |photo| %>
---
SELECT "cars".* FROM "cars" INNER JOIN "user_cars" ON "cars"."id" = "user_cars"."car_id" WHERE "user_cars"."user_id" = ?  [["user_id", 10]]
SELECT "photos".* FROM "photos" WHERE "photos"."car_id" = ?  [["car_id", 7]]