app/controllers/cars_controller.rb

    def show
        @car = Car.find(params[:id])
        @photos = Photo.all.select {|photo| photo.car_id == @car.id}
        @maint_records = MaintRecord.all.select {|record| record.car_id == @car.id}
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "photos".* FROM "photos"
SELECT "maint_records".* FROM "maint_records"

    def create
        @car = Car.new(car_params)
        if @car.valid?
          @car.save
          UserCar.create(user_id: session[:user_id], car: @car) #creates user_cars row
---
INSERT INTO "cars" ("make", "model", "description", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?, ?)  [["make", "Ferrari"], ["model", "lala"], ["description", ""], ["created_at", "2019-10-25 15:26:56.533650"], ["updated_at", "2019-10-25 15:26:56.533650"], ["name", "Luke"]]
INSERT INTO "user_cars" ("user_id", "car_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 11], ["car_id", 17], ["created_at", "2019-10-25 15:16:01.862720"], ["updated_at", "2019-10-25 15:16:01.862720"]]

    def update
        @car = Car.find(params[:id])
        @car.update(car_params)
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "cars" SET "year" = ?, "color" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["year", 2007], ["color", ""], ["updated_at", "2019-10-25 15:41:57.889979"], ["id", 19]]