app/controllers/maint_records_controller.rb

SELECT "maint_records".* FROM "maint_records" WHERE "maint_records"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @maint_record = MaintRecord.find(params[:id])