app/controllers/maint_records_controller.rb

SELECT "maint_records".* FROM "maint_records" ORDER BY created_at
---
  def index
   @maint_records = MaintRecord.order('created_at')

INSERT INTO "maint_records" ("car_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["car_id", 8], ["created_at", "2019-10-25 17:38:20.037406"], ["updated_at", "2019-10-25 17:38:20.037406"]]
---
  def create
   @maint_record = MaintRecord.new(record_params)
   if @maint_record.save

SELECT "maint_records".* FROM "maint_records" WHERE "maint_records"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "maint_records" WHERE "maint_records"."id" = ?  [["id", 14]]
---
  def destroy
 @maint_record = MaintRecord.find(params[:id])
   if @maint_record.destroy