app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos" ORDER BY created_at
---
 def index
  @photos = Photo.order('created_at')

INSERT INTO "photos" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "car_id", "created_at") VALUES (?, ?, ?, ?, ?, ?)
---
 def create

  @photo = Photo.new(photo_params)   #@user_car = UserCar.new(user_id: session[:user_id], car_id: params[:id])
  if @photo.save

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 6]]
---
 def destroy
@photo = Photo.find(params[:id])
  if @photo.destroy