app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["name", "Edwin"], ["created_at", "2019-10-23 16:40:46.100240"], ["updated_at", "2019-10-23 16:40:46.100240"], ["password_digest", "$2a$10$iV.yom0Vd/0WDsOVJz4a1ec4fPjIoN/E45p3l.B9MZaaHiYn/kS5K"]]
---
    def create
      @user = User.new(user_params)

      respond_to do |format|
        if @user.save