app/controllers/user_cars_controller.rb

INSERT INTO "user_cars" ("user_id", "car_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 9], ["car_id", 28], ["created_at", "2019-10-23 23:05:32.167713"], ["updated_at", "2019-10-23 23:05:32.167713"]]
---
  def create

    @user_car = UserCar.new(user_id: session[:user_id], car_id: params[:id])
    @user_car.save